
## Plan Result (aat)




<pre><code>Plan: 7 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_api_management_subscription.exela_supplier_subscription
  * azurerm_api_management_subscription.fee_pay_team_bulk_scan_subscription
  * azurerm_api_management_subscription.iron_mountain_supplier_subscription
  * azurerm_key_vault_secret.exela_supplier_subscription_key
  * azurerm_key_vault_secret.fee_pay_team_bulk_scan_subscription_key
  * azurerm_key_vault_secret.iron_mountain_supplier_subscription_key
  * azurerm_template_deployment.cft-bulk-scanning-payment[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_api_management_subscription.exela_supplier_subscription will be created
  + resource "azurerm_api_management_subscription" "exela_supplier_subscription" {
      + allow_tracing       = true
      + api_management_name = "cft-api-mgmt-stg"
      + display_name        = "Bulk Scanning Payment API - Exela Supplier Subscription"
      + id                  = (known after apply)
      + primary_key         = (sensitive value)
      + product_id          = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.ApiManagement/service/cft-api-mgmt-stg/products/bulk-scanning-payment"
      + resource_group_name = "cft-aat-network-rg"
      + secondary_key       = (sensitive value)
      + state               = "active"
      + subscription_id     = (known after apply)
    }

  # azurerm_api_management_subscription.fee_pay_team_bulk_scan_subscription will be created
  + resource "azurerm_api_management_subscription" "fee_pay_team_bulk_scan_subscription" {
      + allow_tracing       = true
      + api_management_name = "cft-api-mgmt-stg"
      + display_name        = "Bulk Scanning Payment API - Fee and Pay DTS Team Subscription"
      + id                  = (known after apply)
      + primary_key         = (sensitive value)
      + product_id          = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.ApiManagement/service/cft-api-mgmt-stg/products/bulk-scanning-payment"
      + resource_group_name = "cft-aat-network-rg"
      + secondary_key       = (sensitive value)
      + state               = "active"
      + subscription_id     = (known after apply)
    }

  # azurerm_api_management_subscription.iron_mountain_supplier_subscription will be created
  + resource "azurerm_api_management_subscription" "iron_mountain_supplier_subscription" {
      + allow_tracing       = true
      + api_management_name = "cft-api-mgmt-stg"
      + display_name        = "Bulk Scanning Payment API - Iron Mountain Supplier Subscription"
      + id                  = (known after apply)
      + primary_key         = (sensitive value)
      + product_id          = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.ApiManagement/service/cft-api-mgmt-stg/products/bulk-scanning-payment"
      + resource_group_name = "cft-aat-network-rg"
      + secondary_key       = (sensitive value)
      + state               = "active"
      + subscription_id     = (known after apply)
    }

  # azurerm_key_vault_secret.exela_supplier_subscription_key will be created
  + resource "azurerm_key_vault_secret" "exela_supplier_subscription_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccpay-aat/providers/Microsoft.KeyVault/vaults/ccpay-aat"
      + name                    = "exela-cft-apim-subscription-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.fee_pay_team_bulk_scan_subscription_key will be created
  + resource "azurerm_key_vault_secret" "fee_pay_team_bulk_scan_subscription_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccpay-aat/providers/Microsoft.KeyVault/vaults/ccpay-aat"
      + name                    = "fee-pay-team-bulk-scan-cft-apim-subscription-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.iron_mountain_supplier_subscription_key will be created
  + resource "azurerm_key_vault_secret" "iron_mountain_supplier_subscription_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccpay-aat/providers/Microsoft.KeyVault/vaults/ccpay-aat"
      + name                    = "iron-mountain-cft-apim-subscription-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_template_deployment.cft-bulk-scanning-payment[0] will be created
  + resource "azurerm_template_deployment" "cft-bulk-scanning-payment" {
      + deployment_mode     = "Incremental"
      + id                  = (known after apply)
      + name                = "cft-bulk-scanning-payment-aat"
      + outputs             = (known after apply)
      + parameters          = {
          + "apiBasePath"              = "bulk-scanning-payment"
          + "apiManagementServiceName" = "cft-aat-network-rg"
          + "apiName"                  = "bulk-scanning-payment-api"
          + "apiProductName"           = "bulk-scanning-payment"
          + "policy"                   = <<-EOT
                <policies>
                  <backend>
                    <base/>
                  </backend>
                  <inbound>
                    <base/>
                    <choose>
                      <when condition="@(context.Request.Certificate == null || context.Request.Certificate.NotAfter &lt; DateTime.Now || context.Request.Certificate.NotBefore &gt; DateTime.Now || !(new string[] {&quot;7744A2F56BD3B73C0D7FED61309E1C65AF08538C&quot;,&quot;792265A947D0C76D4F67A0878B1D06E60976DFDA&quot;,&quot;4396D69786566676383DD5BFF84B95E2A9975263&quot;,&quot;BFE89B4BA1F47E048CFDF125C2E1BB4E2CC26083&quot;}.Any(c => c == context.Request.Certificate.Thumbprint)))" >
                        <return-response>
                          <set-status code="403" reason="Invalid client certificate."/>
                        </return-response>
                      </when>
                    </choose>
                    <!-- generate totp -->
                    <set-variable name="client_id" value="api_gw" />
                    <set-variable name="client_secret" value="C5OI566EGMPHT3CC" />
                    <set-variable name="one_time_password" value="@{
                                const string Base32AllowedCharacters = &quot;ABCDEFGHIJKLMNOPQRSTUVWXYZ234567&quot;;
                                var bits = &quot;C5OI566EGMPHT3CC&quot;.ToUpper().ToCharArray().Select(c => Convert.ToString(Base32AllowedCharacters.IndexOf(c), 2).PadLeft(5, '0')).Aggregate((a, b) => a + b);
                                var secretKeyBytes = Enumerable.Range(0, bits.Length / 8).Select(i => Convert.ToByte(bits.Substring(i * 8, 8), 2)).ToArray();
                
                                var unixTimestamp = (long) (DateTime.UtcNow.Subtract(new DateTime(1970, 1, 1))).TotalSeconds;
                                var timeIndex = unixTimestamp / 30;
                                byte[] challenge = BitConverter.GetBytes(timeIndex);
                                if (BitConverter.IsLittleEndian) {
                                    Array.Reverse(challenge);
                                }
                
                                HMACSHA1 hmac = new HMACSHA1(secretKeyBytes);
                                byte[] hash = hmac.ComputeHash(challenge);
                                int offset = hash[19] &amp; 0xf;
                                int truncatedHash = hash[offset] &amp; 0x7f;
                                for (int i = 1; i &lt; 4; i++)
                                {
                                    truncatedHash &lt;&lt;= 8;
                                    truncatedHash |= hash[offset + i] &amp; 0xff;
                                }
                                truncatedHash %= 1000000;
                                return truncatedHash.ToString(&quot;D6&quot;);
                            }"/>
                    <send-request ignore-error="false" timeout="20" response-variable-name="s2sBearerToken" mode="new">
                      <set-url>http://rpe-service-auth-provider-aat.service.core-compute-aat.internal/lease</set-url>
                      <set-method>POST</set-method>
                      <set-header name="Content-Type" exists-action="override">
                        <value>application/json</value>
                      </set-header>
                      <set-body>@{
                        return new JObject(
                        new JProperty("microservice", (string)context.Variables["client_id"]),
                        new JProperty("oneTimePassword", (string)context.Variables["one_time_password"])
                        ).ToString();
                        }</set-body>
                    </send-request>
                
                    <set-header name="ServiceAuthorization" exists-action="override">
                      <value>@("Bearer " + ((IResponse)context.Variables["s2sBearerToken"]).Body.As&lt;string&gt;())</value>
                    </set-header>
                  </inbound>
                  <outbound>
                    <base/>
                  </outbound>
                  <on-error>
                    <base/>
                  </on-error>
                </policies>
            EOT
          + "serviceUrl"               = "http://ccpay-bulkscanning-api-aat.service.core-compute-aat.internal"
        }
      + resource_group_name = "cft-aat-network-rg"
      + template_body       = jsonencode(
            {
              + "$schema"      = "http://schema.management.azure.com/schemas/2015-01-01/deploymentTemplate.json#"
              + contentVersion = "1.0.0.0"
              + parameters     = {
                  + apiBasePath              = {
                      + metadata = {
                          + description = "Path to the API (excluding host)"
                        }
                      + type     = "string"
                    }
                  + apiManagementServiceName = {
                      + metadata = {
                          + description = "API Management service name"
                        }
                      + type     = "string"
                    }
                  + apiName                  = {
                      + metadata = {
                          + description = "Name of the API (gateway)"
                        }
                      + type     = "string"
                    }
                  + apiProductName           = {
                      + metadata = {
                          + description = "API Management product name"
                        }
                      + type     = "string"
                    }
                  + policy                   = {
                      + type = "string"
                    }
                  + serviceUrl               = {
                      + metadata = {
                          + description = "URL of the backend service (to be protected by the API)"
                        }
                      + type     = "string"
                    }
                }
              + resources      = [
                  + {
                      + apiVersion = "2017-03-01"
                      + dependsOn  = []
                      + name       = "[concat(parameters('apiManagementServiceName') ,'/', parameters('apiProductName'))]"
                      + properties = {
                          + approvalRequired     = true
                          + displayName          = "[parameters('apiProductName')]"
                          + state                = "published"
                          + subscriptionRequired = true
                        }
                      + type       = "Microsoft.ApiManagement/service/products"
                    },
                  + {
                      + apiVersion = "2017-03-01"
                      + dependsOn  = [
                          + "[resourceId('Microsoft.ApiManagement/service/products', parameters('apiManagementServiceName'), parameters('apiProductName'))]",
                        ]
                      + name       = "[concat(parameters('apiManagementServiceName') ,'/', parameters('apiProductName'), '/', variables('developersGroupName'))]"
                      + properties = {
                          + builtIn     = true
                          + description = "Developers group"
                          + displayName = "Developers"
                          + type        = "system"
                        }
                      + type       = "Microsoft.ApiManagement/service/products/groups"
                    },
                  + {
                      + apiVersion = "2017-03-01"
                      + dependsOn  = [
                          + "[variables('fullApiProductName')]",
                        ]
                      + name       = "[concat(parameters('apiManagementServiceName'), '/', parameters('apiName'))]"
                      + properties = {
                          + displayName = "bulk-scanning payments API"
                          + path        = "[parameters('apiBasePath')]"
                          + protocols   = [
                              + "HTTPS",
                            ]
                          + serviceUrl  = "[parameters('serviceUrl')]"
                        }
                      + resources  = [
                          + {
                              + apiVersion = "2017-03-01"
                              + dependsOn  = [
                                  + "[variables('fullApiName')]",
                                ]
                              + name       = "bulk-scanning-payments-api"
                              + properties = {
                                  + description = "Insert payment data from scanning third party"
                                  + displayName = "bulk-scanning payments api "
                                  + method      = "POST"
                                  + request     = {
                                      + description     = "Used by third party scanning service to insert payments data in Bulk-scanning service"
                                      + representations = [
                                          + {
                                              + contentType = "application/json"
                                              + parameters  = [
                                                  + {
                                                      + description = "BulkScanPayment"
                                                      + in          = "body"
                                                      + name        = "bulkScanPayment"
                                                    },
                                                ]
                                            },
                                        ]
                                    }
                                  + responses   = [
                                      + {
                                          + description = "Created"
                                          + statusCode  = 201
                                        },
                                      + {
                                          + description = "Request failed due to malformed syntax"
                                          + statusCode  = 400
                                        },
                                      + {
                                          + description = "Failed authentication"
                                          + statusCode  = 401
                                        },
                                      + {
                                          + description = "Failed authorisation"
                                          + statusCode  = 403
                                        },
                                      + {
                                          + description = "Conflict"
                                          + statusCode  = 409
                                        },
                                    ]
                                  + urlTemplate = "/bulk-scan-payment"
                                }
                              + type       = "operations"
                            },
                        ]
                      + type       = "Microsoft.ApiManagement/service/apis"
                    },
                  + {
                      + apiVersion = "2017-03-01"
                      + dependsOn  = [
                          + "[variables('fullApiProductName')]",
                          + "[variables('fullApiName')]",
                        ]
                      + name       = "[concat(parameters('apiManagementServiceName'), '/', parameters('apiProductName'), '/', parameters('apiName'))]"
                      + type       = "Microsoft.ApiManagement/service/products/apis"
                    },
                  + {
                      + apiVersion = "2017-03-01"
                      + dependsOn  = [
                          + "[variables('fullApiProductName')]",
                          + "[variables('fullApiName')]",
                        ]
                      + name       = "[concat(parameters('apiManagementServiceName'), '/', parameters('apiName'),'/policy')]"
                      + properties = {
                          + policyContent = "[parameters('policy')]"
                        }
                      + type       = "Microsoft.ApiManagement/service/apis/policies"
                    },
                ]
              + variables      = {
                  + developersGroupName = "Developers"
                  + fullApiName         = "[concat('Microsoft.ApiManagement/service/', parameters('apiManagementServiceName'), '/apis/', parameters('apiName'))]"
                  + fullApiProductName  = "[concat('Microsoft.ApiManagement/service/', parameters('apiManagementServiceName'), '/products/', parameters('apiProductName'))]"
                }
            }
        )
    }

Plan: 7 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":551,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->